{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file providing prewritten summaries of key frontend files and components.",
  "frontend/index.css": "Tailwind base setup defining OKLCH color variables for light and dark modes and applying global background/foreground utilities.",
  "frontend/index.html": "HTML entry point with a root div and script loading the React app.",
  "frontend/src/App.tsx": "Main React component handling level progression, transitions, and global UI like background and header.",
  "frontend/src/components/quiz/levels/CompletionSlide.tsx": "Final slide showing a congratulatory message and themed visuals after level completion.",
  "frontend/src/components/quiz/levels/IntroSlide.tsx": "Intro slide with animated hearts, description text, and a Start button to begin the quiz.",
  "frontend/src/components/quiz/levels/Level1.tsx": "Multiple-choice quiz level that checks a correct answer, triggers success animation, and calls onCorrect or onWrong.",
  "frontend/src/components/quiz/levels/Level2.tsx": "Similar multiple-choice level validating a specific correct option and showing success feedback before advancing.",
  "frontend/src/components/quiz/levels/Level3.tsx": "Simple choice-based level that immediately triggers onCorrect after an option is selected.",
  "frontend/src/components/quiz/levels/Level4.tsx": "Multiple-choice level with a defined correct answer and success overlay, calling onCorrect or onWrong.",
  "frontend/src/components/quiz/levels/Level5.tsx": "Free‑text input level that completes only when the user submits a non‑empty response.",
  "frontend/src/components/quiz/ProgressIndicator.tsx": "Displays numbered circles and heart icons showing the user’s quiz progress.",
  "frontend/src/components/quiz/QuizSlide.tsx": "Generic slide wrapper with a card layout, progress indicator, and responsive title.",
  "frontend/src/components/quiz/SlideTransition.tsx": "Simple opacity-based fade transition wrapper for slide animations.",
  "frontend/src/components/quiz/SuccessFeedbackOverlay.tsx": "Full‑screen animated heart and sparkle burst shown on correct answers.",
  "frontend/src/components/quiz/WrongAnswerToast.tsx": "Top-of-screen dismissible toast notifying the user of a wrong answer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBuzzFeedback.ts": "Provides wrong‑answer feedback state and optional buzz sound playback with safe audio initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, managing login, logout, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing for frontend‑only use.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables and dark‑mode palette definitions.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, Internet Identity, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, container settings, and custom animations.",
  "project_state.json": "Defines the current project state for a 5-level Valentine-themed quiz website, including features, known UI and deployment issues, and version metadata."
}